# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew "wget"
brew 'zlib' # Needed for Memcached
brew "zsh-autosuggestions"


# Network
brew "iperf3"
brew "inetutils"
brew "nmap"

# Python
brew "pipenv"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "poetry"


# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'downie'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask "mailtrackerblocker"
cask 'phpstorm'
cask "pycharm"
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'transmit'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas "DaisyDisk", id: 411643860
mas "Fantastical", id: 975937182
mas "Graphic", id: 404705039
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "Navicat for SQL Server Lite", id: 412149217
mas "Navicat for SQLite Lite", id: 412542909
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Xcode", id: 497799835

